atomvm/AtomVM/src/platforms/stm32/src/lib/stm_sys.h
/* This file is part of AtomVM.
 *
 * Copyright 2023 Winford (Uncle Grumpy) <winford@object.stream>
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *    http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * SPDX-License-Identifier: Apache-2.0 OR LGPL-2.1-or-later
 */

#ifndef _STM_SYS_H_
#define _STM_SYS_H_

#include <interop.h>
#include <portnifloader.h>
#include <sys.h>

#include "stm32_hal_platform.h"

#ifdef ATOMVM_HAS_MBEDTLS
#include <mbedtls/version.h>
#if MBEDTLS_VERSION_NUMBER < 0x04000000
#include <mbedtls/ctr_drbg.h>
#include <mbedtls/entropy.h>
#endif
#endif

#define STM32_ATOM globalcontext_make_atom(ctx->global, ATOM_STR("\x5", "stm32"))

/* Define macros for data and instruction barriers for sys_init_icache() */
// Ensure write is visible
#define __dsb asm __volatile__("dsb" :: \
                                   : "memory");
// Synchronize fetched instruction stream
#define __isb asm __volatile__("isb" :: \
                                   : "memory");

struct LockedPin
{
    struct ListHead locked_pins_list_head;
    uint32_t gpio_bank;
    uint16_t pin_num;
};

struct STM32PlatformData
{
    struct ListHead locked_pins;
#ifdef ATOMVM_HAS_MBEDTLS
    RNG_HandleTypeDef rng;
#if MBEDTLS_VERSION_NUMBER < 0x04000000
    mbedtls_entropy_context entropy_ctx;
    mbedtls_ctr_drbg_context random_ctx;
    bool entropy_is_initialized;
    bool random_is_initialized;
#endif
#endif
};

void sys_init_icache(void);
void sys_enable_flash_cache(void);
void *sbrk(ptrdiff_t);
// This function may be defined to relocate the heap.
void local_heap_setup(uint8_t **start, uint8_t **end);
void sys_enable_core_periph_clocks(void);
bool sys_lock_pin(GlobalContext *glb, uint32_t gpio_bank, uint16_t pin_num);

#endif /* _STM_SYS_H_ */
